Revit 2024 API
TemporaryGraphicsManager.SetVisibility Method
 Changes the visibility of temporary graphics object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public void SetVisibility(
	int index,
	bool visible
)
Visual Basic
Public Sub SetVisibility ( _
	index As Integer, _
	visible As Boolean _
)
Visual C++
public:
void SetVisibility(
	int index,
	bool visible
)
Parameters
index
Type: System.Int32
 Unique index of the temporary graphics object to be updated.
visible
Type: System.Boolean
 if true, it will make the temporary graphics object visible. if false, it will make the temporary graphics object invisible.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  index is out of range of TemporaryGraphicsManager managed objects, or the indexed object has been removed from the document.
See Also
TemporaryGraphicsManager Class
Autodesk.Revit.DB Namespace